<a href="https://colab.research.google.com/github/dubba1212/AIML/blob/master/Assignment_9(5_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**1**[Data Series] 
Write a Python program to add, subtract, multiple and divide two Pandas Series.

In [18]:
import pandas as pd
import numpy as np
s1 = pd.Series([2,4,6,8,10])
s2 = pd.Series([1,3,5,7,9])
add=s1+s2
print(list(s1),"+",list(s2),"=",end=" ")
print(list(add))
sub=s1-s2
print(list(s1),"-",list(s2),"=",end=" ")
print(list(sub))
mul=s1*s2
print(list(s1),"*",list(s2),"=",end=" ")
print(list(mul))
div=s1/s2
print(list(s1),"/",list(s2),"=",end=" ")
print(list(div))

[2, 4, 6, 8, 10] + [1, 3, 5, 7, 9] = [3, 7, 11, 15, 19]
[2, 4, 6, 8, 10] - [1, 3, 5, 7, 9] = [1, 1, 1, 1, 1]
[2, 4, 6, 8, 10] * [1, 3, 5, 7, 9] = [2, 12, 30, 56, 90]
[2, 4, 6, 8, 10] / [1, 3, 5, 7, 9] = [2.0, 1.3333333333333333, 1.2, 1.1428571428571428, 1.1111111111111112]

**2**
[Quartiles] 
Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [19]:
s=pd.Series([3.000938,11.370722,14.612143,8.990256,13.925283,12.056875])
print(s.describe())
print("median:",s.median())

count     6.000000
mean     10.659370
std       4.247050
min       3.000938
25%       9.585373
50%      11.713798
75%      13.458181
max      14.612143
dtype: float64
median: 11.7137985

**3**
[List Difference] 
Write a Pandas program to get the items of a given series not present in another given series.

In [4]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s2 = pd.Series([2,4,6,8,10])
s2

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [6]:
result = s1[~s1.isin(s2)]
print(result)

0    1
2    3
4    5
dtype: int64

In [7]:
z=s1.isin(s2)
print(z)

0    False
1     True
2    False
3     True
4    False
dtype: bool

**4**
[Filter Words with Multiple Vowels] 
Write a Pandas program to filter words from a given series that contain at least two vowels.

In [17]:
s1=pd.Series(['Red','Green','Orange','pink','Yellow','white'])
list1=[]
list2=[]
for i in s1:
  count=0
  for j in (i):
    if j in ['a','e','i','o','u']:
      count+=1
  if count>=2:
    list1.append(i)
  else:
    list2.append(i)
print("filtered words")
df=pd.Series(i for i in list1)
print(df)
print("unfiltered words")
df=pd.Series(i for i in list2)
print(df)

filtered words
0     Green
1    Orange
2    Yellow
3     white
dtype: object
unfiltered words
0     Red
1    pink
dtype: object

**5**
Consider the following as my DataFrame,Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [9]:
import pandas as pd
d = {'a':"Anastasia",'b':"dima",'c':"katherine",'d':"james",'e':"emily",'f':"michael",'g':"matthew",'h':"laura",'i':"kevin",'j':"jonas"}
d1 = {'a':12.5,'b':9,'c':16.5,'e':9,'f':20,'g':14.5,'i':8,'j':19}
d2 = {'a':1,'b':3,'c':2,'d':3,'e':2,'f':3,'g':1,'h':1,'i':2,'j':1}
d3 = {'a':"yes",'b':"no",'c':"yes",'d':"no",'e':"no",'f':"yes",'g':"yes",'h':"no",'i':"no",'j':"yes"}
data = {"name":d,"score":d1,"attempts":d2,"qualify":d3}
df =pd.DataFrame(data)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       dima    9.0         3      no
c  katherine   16.5         2     yes
d      james    NaN         3      no
e      emily    9.0         2      no
f    michael   20.0         3     yes
g    matthew   14.5         1     yes
h      laura    NaN         1      no
i      kevin    8.0         2      no
j      jonas   19.0         1     yes

In [10]:
data = {"name":d,"score":d1,"attempts":d2,"qualify":d3}
df =pd.DataFrame(data)
print("attempts greater then 2 are:-")
print(df[df['attempts']>2])

attempts greater then 2 are:-
      name  score  attempts qualify
b     dima    9.0         3      no
d    james    NaN         3      no
f  michael   20.0         3     yes